# Q. 1
List any five functions of the pandas library with execution.

Here are five commonly used functions from the pandas library along with their executions:

## pd.read_csv(): This function is used to read data from a CSV (Comma-Separated Values) file and create a DataFrame.

In [3]:
import pandas as pd
df = pd.read_csv('student_assign')
df

   Unnamed: 0  student_id  test_score
0           0           1          85
1           1           2          90
2           2           3          80
3           3           4          75
4           4           5          85
5           5           6          82
6           6           7          78
7           7           8          85
8           8           9          90
9           9          10          85

## df.head(): This method is used to display the first few rows of a DataFrame. It's useful for quickly inspecting the structure of the data.

In [4]:
df.head()

   Unnamed: 0  student_id  test_score
0           0           1          85
1           1           2          90
2           2           3          80
3           3           4          75
4           4           5          85

# df.info(): This method provides a summary of the DataFrame's basic information including the data types, non-null counts, and memory usage.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10 non-null     int64
 1   student_id  10 non-null     int64
 2   test_score  10 non-null     int64
dtypes: int64(3)
memory usage: 368.0 bytes

# df.groupby(): This method is used for grouping data based on one or more columns and performing aggregate operations on them.

In [14]:
df1 = df.groupby('test_score')

In [15]:
df1

## 'df.tail' this function is used to display last five data

In [19]:
df.tail()

   Unnamed: 0  student_id  test_score
5           5           6          82
6           6           7          78
7           7           8          85
8           8           9          90
9           9          10          85

## 'df.column' is used to diplay all the column from the intire data set

In [27]:
import pandas as pd
df = pd.read_csv('student_assign')
df

   Unnamed: 0  student_id  test_score
0           0           1          85
1           1           2          90
2           2           3          80
3           3           4          75
4           4           5          85
5           5           6          82
6           6           7          78
7           7           8          85
8           8           9          90
9           9          10          85

# Q.2
Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [28]:
import pandas as pd

In [29]:
data = {'A': [10, 20, 30, 40],
        'B': [100, 200, 300, 400],
        'C': [1000, 2000, 3000, 4000]}

In [30]:
df = pd.DataFrame(data)

In [31]:
df

    A    B     C
0  10  100  1000
1  20  200  2000
2  30  300  3000
3  40  400  4000

In [32]:
new_index = pd.RangeIndex(start=1, step=2, stop=len(df) * 2, name='CustomIndex')

In [33]:
new_df = df.reset_index(drop=True).set_index(new_index)

In [34]:
new_df

              A    B     C
CustomIndex
1            10  100  1000
3            20  200  2000
5            30  300  3000
7            40  400  4000

# Q3.
You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [35]:
df

    A    B     C
0  10  100  1000
1  20  200  2000
2  30  300  3000
3  40  400  4000

In [38]:
df1 = df['B'].head(3)

In [40]:
df1.sum()

600

# Q4.
   Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [1]:
import pandas as pd

In [2]:
data = {'student':['sudh','kumar','krish','naik'],
       'marks':[96,98,93,99]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  student  marks
0    sudh     96
1   kumar     98
2   krish     93
3    naik     99

In [5]:
# Create a new column of 'student'

In [18]:
df['Word_Count'] = df['student'].apply(len)

In [19]:
df

  student  marks  Word_Count
0    sudh     96           4
1   kumar     98           5
2   krish     93           5
3    naik     99           4

# Q5.
How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size:
DataFrame.size returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns.
It gives you the total count of cells or values in the DataFrame.
The value returned is an integer.

DataFrame.shape:
DataFrame.shape returns a tuple containing the number of rows and the number of columns in the DataFrame.
It provides a way to understand the structure of the DataFrame, giving you the dimensions.

# Q6.
Which function of pandas do we use to read an excel file?

In pandas, you can use the pd.read_excel() function to read data from an Excel file. This function reads data from Excel spreadsheets into a pandas DataFrame.

# Q7
. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [29]:
import pandas as pd

In [30]:
data = {'Name':['sudh','kumar','krish','naik'],
       'Email':['sudh@gmail.com','kumar@gmail.com','krish.naik@gmail.com','naik.krish@gmail.com']}

In [31]:
df = pd.DataFrame(data)

In [32]:
df

    Name                 Email
0   sudh        sudh@gmail.com
1  kumar       kumar@gmail.com
2  krish  krish.naik@gmail.com
3   naik  naik.krish@gmail.com

In [33]:
df['UserName'] = df['Email'].str.split('@').str[0]

In [34]:
df

    Name                 Email    UserName
0   sudh        sudh@gmail.com        sudh
1  kumar       kumar@gmail.com       kumar
2  krish  krish.naik@gmail.com  krish.naik
3   naik  naik.krish@gmail.com  naik.krish

# Q8.
You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [36]:
import pandas as pd

In [37]:
data = {'A':[3,8,6,2,9], 'B':[5,2,9,3,1], 'C':[1,7,4,5,2]}

In [68]:
df = pd.DataFrame(data)

In [79]:
select_row = (df['A'] > 5)  & (df['B'] < 10)

In [81]:
select_df = df[select_row]

In [82]:
select_df

   A  B  C  new_data
1  8  2  7      True
2  6  9  4      True
4  9  1  2      True

In [96]:
def filter_dataframe(df):
    select_row = (df['A'] > 5)  & (df['B'] < 10)
    return select_row

In [97]:
data = {'A':[3,8,6,2,9], 'B':[5,2,9,3,1], 'C':[1,7,4,5,2]}

In [98]:
df = pd.DataFrame(data)

In [99]:
select_df = filter_dataframe(df)

In [100]:
df[select_df]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9.
Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [101]:
data = {'Value':[23,13,45,34,66]}

In [105]:
df = pd.DataFrame(data)

In [106]:
df.mean()

Value    36.2
dtype: float64

In [107]:
df.median()

Value    34.0
dtype: float64

In [109]:
df.std()

Value    20.510973
dtype: float64

# Q10.
Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [111]:
import pandas as pd

In [114]:
data = {'Date': pd.date_range(start=2023-8-1, periods=30), 
       'Sales':[10, 20, 15, 30, 25, 35, 40, 50, 45, 55,
                  60, 70, 65, 75, 80, 90, 85, 95, 100, 110,
                  105, 115, 120, 130, 125, 135, 140, 150, 145, 155]}

In [115]:
df = pd.DataFrame(data)

In [117]:
df.head()

                           Date  Sales
0 1970-01-01 00:00:00.000002014     10
1 1970-01-02 00:00:00.000002014     20
2 1970-01-03 00:00:00.000002014     15
3 1970-01-04 00:00:00.000002014     30
4 1970-01-05 00:00:00.000002014     25

In [121]:
def moving_avrg(df):
    df['moving_avrg'] = df['Sales'].rolling(window=7, min_periods=1,).mean()
    return df

In [123]:
moving_avrg(df).head()

                           Date  Sales  moving_avrg
0 1970-01-01 00:00:00.000002014     10        10.00
1 1970-01-02 00:00:00.000002014     20        15.00
2 1970-01-03 00:00:00.000002014     15        15.00
3 1970-01-04 00:00:00.000002014     30        18.75
4 1970-01-05 00:00:00.000002014     25        20.00

# Q11.
You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [127]:
import pandas as pd
data = {'date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']}
df = pd.DataFrame(data)
df

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [129]:
def weekday_column(df):
    df['Date'] = pd.to_datetime(df['date'])
    df['weekday'] = df['Date'].dt.strftime('%A')
    return df

In [130]:
weekday_column(df)

         date       Date    weekday
0  2023-01-01 2023-01-01     Sunday
1  2023-01-02 2023-01-02     Monday
2  2023-01-03 2023-01-03    Tuesday
3  2023-01-04 2023-01-04  Wednesday
4  2023-01-05 2023-01-05   Thursday

# Q12.
Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [132]:
import pandas as pd
data = {'Date': ['2023-01-15', '2023-02-10', '2023-01-05', '2023-01-25']}
df = pd.DataFrame(data)
df

         Date
0  2023-01-15
1  2023-02-10
2  2023-01-05
3  2023-01-25

In [133]:
df['Date'] = pd.to_datetime(df['Date'])

In [134]:
 mask = (df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')

In [135]:
selected_rows = df[mask]

In [138]:
df[select_row]

C:\Users\admin\AppData\Local\Temp\ipykernel_12972\697800580.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[select_row]

        Date
1 2023-02-10
2 2023-01-05

# Q13.
To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

To use the basic functions of pandas, you need to import the pandas library itself. You can do this using the following import statement:

In [139]:
import pandas as pd

By convention, pandas is often imported with the alias 'pd', which allows you to use the pandas functions and classes with the shortened 'pd' prefix. This is a common practice in the pandas community and makes the code more concise and readable.